In [5]:
# merge結合　キーを指定して結合　3つ以上はできない
import pandas as pd

df1 = pd.read_excel('merge1.xlsx')
df2 = pd.read_excel('merge2.xlsx')
df3 = pd.read_excel('merge3.xlsx')

display(df1)
display(df2)
display(df3)

  user id  age  address
0   A0001   27    Tokyo
1   B0001   25    Chiba
2   C0001   19    Kyoto
3   D0001   30  Fukuoka

  user id  price
0   D0001   7000
1   B0001   2700
2   C0001   5600
3   A0001   1900

  user id  price
0   D0001   7000
1   B0001   2700
2   Z0001   1900

In [2]:
pd.merge(df1, df2, on='user id') 
# how='left'とすると左のキーは残して結合する

  user id  age  address  price
0   A0001   27    Tokyo   1900
1   B0001   25    Chiba   2700
2   C0001   19    Kyoto   5600
3   D0001   30  Fukuoka   7000

In [8]:
pd.merge(df1, df3, on='user id')

  user id  age  address  price
0   B0001   25    Chiba   2700
1   D0001   30  Fukuoka   7000

In [9]:
pd.merge(df1, df3, on='user id', how='left')

  user id  age  address   price
0   A0001   27    Tokyo     NaN
1   B0001   25    Chiba  2700.0
2   C0001   19    Kyoto     NaN
3   D0001   30  Fukuoka  7000.0

In [10]:
pd.merge(df1, df3, on='user id', how='right')

  user id   age  address  price
0   D0001  30.0  Fukuoka   7000
1   B0001  25.0    Chiba   2700
2   Z0001   NaN      NaN   1900